app/controllers/api/channels_controller.rb

SELECT "channels".* FROM "channels"
---
    def index
        if params[:user_id]
            @channels = current_user.channels
            render :index
        else
            @channels = Channel.all

SELECT  "channels".* FROM "channels" WHERE "channels"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
---
    def show
        @channel = Channel.find(params[:id])

INSERT INTO "channels" ("name", "description", "admin_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "kjlkfasjlksd"], ["description", "adjfkjadkjfkdsjf"], ["admin_id", 34], ["created_at", "2020-09-26 14:26:23.664210"], ["updated_at", "2020-09-26 14:26:23.664210"]]
---
    def create

        @channel = Channel.new(channel_params)
        if @channel.save

SELECT  "channels".* FROM "channels" WHERE "channels"."id" = $1 LIMIT $2  [["id", 30], ["LIMIT", 1]]
UPDATE "channels" SET "description" = $1, "updated_at" = $2 WHERE "channels"."id" = $3  [["description", "a new description"], ["updated_at", "2020-09-26 15:00:10.189443"], ["id", 30]]
---
    def update
        @channel = Channel.find(params[:id])
        if @channel.update(channel_params)

SELECT  "channels".* FROM "channels" WHERE "channels"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]
DELETE FROM "channels" WHERE "channels"."id" = $1  [["id", 28]]
---
    def destroy
        @channel = Channel.find(params[:id])
        if @channel.destroy