app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "/NXisnEJT/YMlFmXp3Ufc85FM8Or3ybkC4/xDPpr7gfyN0l9zLs7ecHF9K833fVc6l3VDjarjt5ke7jRnh4LOA=="], ["LIMIT", 1]]
---
    def current_user
        @current_user = User.find_by(session_token: session[:session_token])